IdeaRS.OpenModel.Concrete.TypeOfCalculationDeflection
Define type of support conditions

IdeaRS.OpenModel.Concrete.TypeOfCalculationDeflection.CheckSlenderness
check slenderness calculation, if rules are full filed no other calculation is done

IdeaRS.OpenModel.Concrete.TypeOfCalculationDeflection.CheckSlendernessContinueDirectCalculation
if check of slenderness is not ok then, directly calculation of deflection is done

IdeaRS.OpenModel.Concrete.TypeOfCalculationDeflection.DirectCalculation
check of slenderness is not taken into account, directly calculation of deflection is done

IdeaRS.OpenModel.Concrete.TypeOfCalculationDeflection.BothOfThem
both calculation is done, it is for comparative results